using System;
using UnityEngine;

public class ParametrsNPC : MonoBehaviour
{
    public GemLocate gemLocate;
    public string[] MassNameNPC;
    public int GemNPC;
    public string NameNPC;

    public void Start()
    {
        GeneratName(); // генерируем при старте игры
        Array.Clear(MassNameNPC, 0, MassNameNPC.Length); // Освобождаем место в памяти
        
    }
    public void OnTriggerEnter(Collider other)
    {
        if (other.tag == "Gem")
        {
            Debug.Log("NPC gem up");
            Destroy(other.gameObject);
            GemNPC++;
        }
    }


    // Генерация рандомных имён для NPC
    public void GeneratName()
    {
        MassNameNPC = new string[] 
        {
            "Адам","Степан","Арина","Игорь","Артемий","Таисия","Даниил","Марина","Михаил","Эвелина",
            "Арсений","Макар","Мирон","Варвара","Ольга","Елизавета","Лев","Анастасия","Ксения","Лея",
            "Кристина","Камилла","Марк","Артём","Владимир","Фёдор","София","Екатерина","Маргарита","Дарья",
            "Егор","Евгения","Милана","Захар","Александр","Константин","Есения","Алина","Лука","Матвей","Лада",
            "Георгий","Вероника","Богдан","Василиса","Платон","Максим","Алёна","Олеся","Александра","Софья","Роберт",
            "Роман","Мария","Андрей","Вера","Юрий","Алиса","Малика","Анна","Гордей","Ева","Мадина","Виктория","Ярослав",
            "Али","Кирилл","Иван","Пётр","Полина","Валерия","Юлия","Аглая","Григорий","Илья","Савелий","Арсен","Марьям",
            "Николай","Майя","Сергей","Тимофей","Серафим","Никита","Тимур","Святослав","Злата","Дмитрий","Демид","Денис",
            "Виктор","Амина","Филипп","Наталья","Вячеслав","Ника","Алия","Владислав","Айлин","Любовь"
        };
        int Arr = 0;
        Arr = UnityEngine.Random.Range(0, MassNameNPC.Length);
        NameNPC = MassNameNPC[Arr];
        MassNameNPC = new string[0];
    }
}
